app/controllers/bills_controller.rb

SELECT "bills".* FROM "bills"
---
  def index
    @bills = Bill.all

SELECT "bills_items".* FROM "bills_items" WHERE "bills_items"."bill_id" = ?  [["bill_id", 10]]
---
  def show
    @items = BillsItem.where(bill_id: params[:id])

INSERT INTO "bills" ("total_amount", "created_at", "updated_at") VALUES (?, ?, ?)  [["total_amount", 100], ["created_at", "2018-09-14 04:14:59.509877"], ["updated_at", "2018-09-14 04:14:59.509877"]]
---
  def create
    @bill = Bill.new(bill_params)

    respond_to do |format|
      if @bill.save

DELETE FROM "bills" WHERE "bills"."id" = ?  [["id", 1]]
---
  def destroy
    @bill.destroy

SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_bill
      @bill = Bill.find(params[:id])