app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "body", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "kartavy"], ["body", "#sd #asd"], ["price", 123], ["created_at", "2018-09-13 18:55:39.172311"], ["updated_at", "2018-09-13 18:55:39.172311"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "body" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["body", "#sd #asd #asfas"], ["updated_at", "2018-09-13 18:57:39.480383"], ["id", 1]]